## Plan Result (cftptl)




<pre><code>Plan: 35 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azapi_resource.AIServices
  * azapi_resource.AIServicesConnection
  * azapi_resource.hub
  * azapi_resource.project
  * azurerm_cognitive_deployment.model
  * azurerm_cosmosdb_account.cosmosdb
  * azurerm_cosmosdb_sql_container.this
  * azurerm_cosmosdb_sql_database.this
  * azurerm_cosmosdb_sql_role_assignment.identity_contributor
  * azurerm_cosmosdb_sql_role_assignment.platops_contributor
  * azurerm_cosmosdb_sql_role_assignment.search_service_reader
  * azurerm_key_vault_access_policy.implicit_managed_identity_access_policy
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_resource_group.this
  * azurerm_role_assignment.identity_access_to_ai_services
  * azurerm_role_assignment.identity_access_to_search
  * azurerm_role_assignment.platops_access_to_ai_services
  * azurerm_role_assignment.platops_access_to_search
  * azurerm_role_assignment.search_contributor_hmcts_way
  * azurerm_role_assignment.search_search_reader
  * azurerm_role_assignment.storage_blob_data_contributor_hmcts_way
  * azurerm_role_assignment.storage_blob_data_contributor_platops
  * azurerm_role_assignment.storage_blob_data_reader_search_service
  * azurerm_search_service.this
  * azurerm_storage_account.default
  * azurerm_storage_container.hmcts_way
  * azurerm_user_assigned_identity.managed_identity
  * restapi_object.cosmos_datasource
  * restapi_object.help_request_index
  * restapi_object.help_request_indexer
  * restapi_object.hmcts_way_index
  * restapi_object.hmcts_way_indexer
  * restapi_object.storage_account_datasource
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_search_service.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_search_service" "this" {
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "platops-slack-help-bot-ptl"
      + partition_count               = (known after apply)
      + primary_key                   = (sensitive value)
      + public_network_access_enabled = (known after apply)
      + query_keys                    = (known after apply)
      + replica_count                 = (known after apply)
      + resource_group_name           = "slack-help-bot-cftptl-intsvc-rg"
      + secondary_key                 = (sensitive value)
    }

  # azapi_resource.AIServices will be created
  + resource "azapi_resource" "AIServices" {
      + body                      = jsonencode(
            {
              + kind       = "AIServices"
              + name       = "platops-slack-help-bot-ptl"
              + properties = {
                  + apiProperties       = {
                      + statisticsEnabled = false
                    }
                  + customSubDomainName = "platops-slack-help-bot-ptl"
                }
              + sku        = {
                  + name = "S0"
                }
            }
        )
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "uksouth"
      + name                      = "platops-slack-help-bot-ptl"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + response_export_values    = [
          + "*",
        ]
      + schema_validation_enabled = true
      + tags                      = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/slack-help-bot"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + type                      = "Microsoft.CognitiveServices/accounts@2023-10-01-preview"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azapi_resource.AIServicesConnection will be created
  + resource "azapi_resource" "AIServicesConnection" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "platops-slack-help-bot-ptl"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + response_export_values    = [
          + "*",
        ]
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.MachineLearningServices/workspaces/connections@2024-04-01-preview"
    }

  # azapi_resource.hub will be created
  + resource "azapi_resource" "hub" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "uksouth"
      + name                      = "platops-slack-help-bot-hub-ptl"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = {
          + "__SYSTEM__AIServices_platops-slack-help-bot-ptl"       = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.CognitiveServices/accounts/platops-slack-help-bot-ptl"
          + "__SYSTEM__AzureOpenAI_platops-slack-help-bot-ptl_aoai" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.CognitiveServices/accounts/platops-slack-help-bot-ptl"
          + "application"                                           = "core"
          + "builtFrom"                                             = "hmcts/slack-help-bot"
          + "businessArea"                                          = "CFT"
          + "criticality"                                           = "High"
          + "environment"                                           = "production"
          + "startupMode"                                           = "always"
        }
      + type                      = "Microsoft.MachineLearningServices/workspaces@2024-04-01-preview"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azapi_resource.project will be created
  + resource "azapi_resource" "project" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "uksouth"
      + name                      = "platops-slack-help-bot-ptl"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.MachineLearningServices/workspaces@2024-04-01-preview"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_cognitive_deployment.model will be created
  + resource "azurerm_cognitive_deployment" "model" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "gpt-4"
      + rai_policy_name        = "Microsoft.DefaultV2"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-4"
          + version = "0125-Preview"
        }

      + scale {
          + capacity = 36
          + type     = "Standard"
        }
    }

  # azurerm_cosmosdb_account.cosmosdb will be created
  + resource "azurerm_cosmosdb_account" "cosmosdb" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + automatic_failover_enabled                   = (known after apply)
      + connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + enable_automatic_failover                    = (known after apply)
      + enable_free_tier                             = (known after apply)
      + enable_multiple_write_locations              = (known after apply)
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = true
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "uksouth"
      + minimal_tls_version                          = (known after apply)
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = (known after apply)
      + name                                         = "platops-slack-help-bot-ptl"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "slack-help-bot-cftptl-intsvc-rg"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + tags                                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/slack-help-bot"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + write_endpoints                              = (known after apply)

      + analytical_storage (known after apply)

      + backup (known after apply)

      + capabilities (known after apply)

      + capacity {
          + total_throughput_limit = 1000
        }

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "uksouth"
          + zone_redundant    = false
        }
    }

  # azurerm_cosmosdb_sql_container.this will be created
  + resource "azurerm_cosmosdb_sql_container" "this" {
      + account_name          = "platops-slack-help-bot-ptl"
      + database_name         = "help-requests"
      + default_ttl           = -1
      + id                    = (known after apply)
      + name                  = "help-requests"
      + partition_key_kind    = "Hash"
      + partition_key_path    = (known after apply)
      + partition_key_paths   = [
          + "/id",
        ]
      + partition_key_version = 2
      + resource_group_name   = "slack-help-bot-cftptl-intsvc-rg"
      + throughput            = (known after apply)

      + autoscale_settings {
          + max_throughput = 1000
        }

      + conflict_resolution_policy (known after apply)

      + indexing_policy {
          + indexing_mode = "consistent"

          + included_path {
              + path = "/*"
            }
        }
    }

  # azurerm_cosmosdb_sql_database.this will be created
  + resource "azurerm_cosmosdb_sql_database" "this" {
      + account_name        = "platops-slack-help-bot-ptl"
      + id                  = (known after apply)
      + name                = "help-requests"
      + resource_group_name = "slack-help-bot-cftptl-intsvc-rg"
      + throughput          = (known after apply)
    }

  # azurerm_cosmosdb_sql_role_assignment.identity_contributor will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "identity_contributor" {
      + account_name        = "platops-slack-help-bot-ptl"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "slack-help-bot-cftptl-intsvc-rg"
      + role_definition_id  = (known after apply)
      + scope               = (known after apply)
    }

  # azurerm_cosmosdb_sql_role_assignment.platops_contributor will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "platops_contributor" {
      + account_name        = "platops-slack-help-bot-ptl"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + resource_group_name = "slack-help-bot-cftptl-intsvc-rg"
      + role_definition_id  = (known after apply)
      + scope               = (known after apply)
    }

  # azurerm_cosmosdb_sql_role_assignment.search_service_reader will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "search_service_reader" {
      + account_name        = "platops-slack-help-bot-ptl"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "slack-help-bot-cftptl-intsvc-rg"
      + role_definition_id  = (known after apply)
      + scope               = (known after apply)
    }

  # azurerm_key_vault_access_policy.implicit_managed_identity_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "slack-help-bot-cftptl-intsvc-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/slack-help-bot"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
    }

  # azurerm_role_assignment.identity_access_to_ai_services will be created
  + resource "azurerm_role_assignment" "identity_access_to_ai_services" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Cognitive Services OpenAI User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.identity_access_to_search will be created
  + resource "azurerm_role_assignment" "identity_access_to_search" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Search Index Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.platops_access_to_ai_services will be created
  + resource "azurerm_role_assignment" "platops_access_to_ai_services" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Cognitive Services OpenAI User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.platops_access_to_search will be created
  + resource "azurerm_role_assignment" "platops_access_to_search" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Search Index Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.search_contributor_hmcts_way will be created
  + resource "azurerm_role_assignment" "search_contributor_hmcts_way" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "29703cf0-15f5-411c-be38-425663df214b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Search Service Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.search_search_reader will be created
  + resource "azurerm_role_assignment" "search_search_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Cosmos DB Account Reader Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.storage_blob_data_contributor_hmcts_way will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor_hmcts_way" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "29703cf0-15f5-411c-be38-425663df214b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.storage_blob_data_contributor_platops will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor_platops" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.storage_blob_data_reader_search_service will be created
  + resource "azurerm_role_assignment" "storage_blob_data_reader_search_service" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_search_service.this will be created
  + resource "azurerm_search_service" "this" {
      + authentication_failure_mode              = "http403"
      + customer_managed_key_enforcement_enabled = false
      + hosting_mode                             = "default"
      + id                                       = (known after apply)
      + local_authentication_enabled             = true
      + location                                 = "uksouth"
      + name                                     = "platops-slack-help-bot-ptl"
      + partition_count                          = 1
      + primary_key                              = (sensitive value)
      + public_network_access_enabled            = true
      + query_keys                               = (known after apply)
      + replica_count                            = 1
      + resource_group_name                      = "slack-help-bot-cftptl-intsvc-rg"
      + secondary_key                            = (sensitive value)
      + semantic_search_sku                      = "standard"
      + sku                                      = "basic"
      + tags                                     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/slack-help-bot"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_storage_account.default will be created
  + resource "azurerm_storage_account" "default" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "platopslackhelpbotai"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "slack-help-bot-cftptl-intsvc-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/slack-help-bot"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days                     = 7
              + permanent_delete_enabled = false
            }
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

  # azurerm_storage_container.hmcts_way will be created
  + resource "azurerm_storage_container" "hmcts_way" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "the-hmcts-way"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "platopslackhelpbotai"
    }

  # azurerm_user_assigned_identity.managed_identity will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "slack-help-bot-cftptl-intsvc-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-cftptl-intsvc-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/slack-help-bot"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

  # restapi_object.cosmos_datasource will be created
  + resource "restapi_object" "cosmos_datasource" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (known after apply)
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/datasources"
      + query_string    = "api-version=2023-10-01-Preview"
    }

  # restapi_object.help_request_index will be created
  + resource "restapi_object" "help_request_index" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = jsonencode(
            {
              + fields   = [
                  + {
                      + filterable = false
                      + name       = "id"
                      + searchable = false
                      + sortable   = false
                      + type       = "Edm.String"
                    },
                  + {
                      + filterable  = true
                      + name        = "created_at"
                      + retrievable = true
                      + searchable  = false
                      + sortable    = true
                      + type        = "Edm.DateTimeOffset"
                    },
                  + {
                      + filterable = false
                      + key        = true
                      + name       = "key"
                      + searchable = false
                      + sortable   = false
                      + type       = "Edm.String"
                    },
                  + {
                      + filterable = false
                      + name       = "status"
                      + searchable = false
                      + sortable   = false
                      + type       = "Edm.String"
                    },
                  + {
                      + filterable = true
                      + name       = "area"
                      + searchable = false
                      + sortable   = false
                      + type       = "Edm.String"
                    },
                  + {
                      + filterable = true
                      + name       = "title"
                      + searchable = true
                      + sortable   = true
                      + type       = "Edm.String"
                    },
                  + {
                      + filterable = true
                      + name       = "description"
                      + searchable = true
                      + sortable   = true
                      + type       = "Edm.String"
                    },
                  + {
                      + filterable = false
                      + name       = "analysis"
                      + searchable = true
                      + sortable   = true
                      + type       = "Edm.String"
                    },
                  + {
                      + filterable = false
                      + name       = "rid"
                      + searchable = false
                      + sortable   = false
                      + type       = "Edm.String"
                    },
                  + {
                      + filterable = false
                      + name       = "url"
                      + searchable = false
                      + sortable   = false
                      + type       = "Edm.String"
                    },
                ]
              + name     = "help-requests"
              + semantic = {
                  + configurations = [
                      + {
                          + name              = "help-requests"
                          + prioritizedFields = {
                              + prioritizedContentFields  = [
                                  + {
                                      + fieldName = "description"
                                    },
                                  + {
                                      + fieldName = "analysis"
                                    },
                                ]
                              + prioritizedKeywordsFields = []
                              + titleField                = {
                                  + fieldName = "title"
                                }
                            }
                        },
                    ]
                }
            }
        )
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/indexes"
      + query_string    = "api-version=2023-10-01-Preview"
    }

  # restapi_object.help_request_indexer will be created
  + resource "restapi_object" "help_request_indexer" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = jsonencode(
            {
              + dataSourceName  = "help-requests"
              + name            = "help-requests-indexer"
              + schedule        = {
                  + interval  = "PT5M"
                  + startTime = "2024-07-19T15:32:09.422Z"
                }
              + targetIndexName = "help-requests"
            }
        )
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/indexers"
      + query_string    = "api-version=2023-10-01-Preview"
    }

  # restapi_object.hmcts_way_index will be created
  + resource "restapi_object" "hmcts_way_index" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = jsonencode(
            {
              + fields   = [
                  + {
                      + facetable  = false
                      + filterable = false
                      + key        = true
                      + name       = "id"
                      + searchable = false
                      + sortable   = false
                      + type       = "Edm.String"
                    },
                  + {
                      + facetable  = false
                      + filterable = true
                      + name       = "metadata_storage_last_modified"
                      + searchable = false
                      + sortable   = false
                      + type       = "Edm.DateTimeOffset"
                    },
                  + {
                      + facetable  = false
                      + filterable = true
                      + name       = "title"
                      + searchable = true
                      + sortable   = true
                      + type       = "Edm.String"
                    },
                  + {
                      + facetable  = false
                      + filterable = true
                      + name       = "metadata_storage_name"
                      + searchable = true
                      + sortable   = true
                      + type       = "Edm.String"
                    },
                  + {
                      + facetable  = false
                      + filterable = true
                      + name       = "metadata_storage_path"
                      + searchable = true
                      + sortable   = true
                      + type       = "Edm.String"
                    },
                  + {
                      + facetable  = false
                      + filterable = true
                      + name       = "metadata_storage_content_md5"
                      + sortable   = true
                      + type       = "Edm.String"
                    },
                  + {
                      + facetable  = false
                      + filterable = false
                      + name       = "content"
                      + searchable = true
                      + sortable   = false
                      + type       = "Edm.String"
                    },
                ]
              + name     = "the-hmcts-way"
              + semantic = {
                  + configurations = [
                      + {
                          + name              = "the-hmcts-way"
                          + prioritizedFields = {
                              + prioritizedContentFields  = [
                                  + {
                                      + fieldName = "content"
                                    },
                                ]
                              + prioritizedKeywordsFields = []
                              + titleField                = {
                                  + fieldName = "title"
                                }
                            }
                        },
                    ]
                }
            }
        )
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/indexes"
      + query_string    = "api-version=2023-10-01-Preview"
    }

  # restapi_object.hmcts_way_indexer will be created
  + resource "restapi_object" "hmcts_way_indexer" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = jsonencode(
            {
              + dataSourceName  = "the-hmcts-way"
              + name            = "the-hmcts-way"
              + parameters      = {
                  + configuration = {
                      + imageAction               = "none"
                      + indexedFileNameExtensions = ".html"
                    }
                }
              + targetIndexName = "the-hmcts-way"
            }
        )
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/indexers"
      + query_string    = "api-version=2023-10-01-Preview"
    }

  # restapi_object.storage_account_datasource will be created
  + resource "restapi_object" "storage_account_datasource" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (known after apply)
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/datasources"
      + query_string    = "api-version=2023-10-01-Preview"
    }

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "slack-help-bot-ptl"
      + resource_group_name                   = "slack-help-bot-cftptl-intsvc-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/slack-help-bot"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + workspace_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - slack-help-bot-ptl"
      + resource_group_name = "slack-help-bot-cftptl-intsvc-rg"
      + scopes              = (known after apply)
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/slack-help-bot"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }

      + action {
          + action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = null
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

Plan: 35 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":418,"Program":"tfcmt","SHA1":"","Target":"cftptl","Vars":{}} -->